:PROPERTIES:
:ID:       7c81edf4-31fc-4a87-9104-6072d6115880
:END:
#+title: Bibliography Review
#+OPTIONS: toc:nil
#+LaTeX_HEADER: \newenvironment{results}{}{}

* Articles
#+begin_src bash :results org :wrap :exports results
# echo "oi"
for i in $(ls reference/* ); do
echo -e "- [[file:$i::Motivation][$(basename ${i%.*})]] :: "
awk '/*** Motivation/,/*** Model/{print "  "$0}' $i | grep -v '\*\*\* Motivation\|\*\*\* Model'
done
#+end_src

#+RESULTS:
#+begin_results
- [[file:reference/AastroemWittenmark1989.org::Motivation][AastroemWittenmark1989]] ::
  Book about adaptive control, great reference for real time parameter estimation, Recursive Least-squares and etc
- [[file:reference/AfsiEtAl2020.org::Motivation][AfsiEtAl2020]] ::
  MPC used to control polylactic acid (PLA) fabrication
- [[file:reference/AgbodjanEtAl2019.org::Motivation][AgbodjanEtAl2019]] ::
  Increase resilience during power outages, maintaining a least level of energy
- [[file:reference/AlessioBemporad2009.org::Motivation][AlessioBemporad2009]] ::
  Survey on Explicit MPC
- [[file:reference/AnandutaEtAl2020.org::Motivation][AnandutaEtAl2020]] ::
  Resilient [[id:92ed23b5-1480-4241-b074-a5b4a1d42069][DMPC]] under Attack using [[id:c34a53cd-f404-415a-b26e-0c4ed12b20a1][Bayesian Inference]]
  Good example of distribution network
- [[file:reference/ArabloueiEtAl2014.org::Motivation][ArabloueiEtAl2014]] ::
  An unbiased recursive least-squares estimator
- [[file:reference/AranovskiyFreidovich2013.org::Motivation][AranovskiyFreidovich2013]] ::
  Identification-based adaptive tuning of coefficients with unknown disturbance
- [[file:reference/ArauzEtAl2021.org::Motivation][ArauzEtAl2021]] ::
  Raise awareness of vulnerabilities in [[id:92ed23b5-1480-4241-b074-a5b4a1d42069][DMPC]]
- [[file:reference/BansalMukhija2020.org::Motivation][BansalMukhija2020]] ::
  Hybrid Triggering scheme (Aperiodic Sampled-Data Control) to control Networked system under stochastic Deception Attacks find a way to obtain Minimum inter-event time (MIET)
- [[file:reference/BaudryCeleux2015.org::Motivation][BaudryCeleux2015]] ::
  Different methods to initialize [[id:1d06659d-d255-4ce2-a590-2652c630a32d][Expectation Maximization]] and how to avoid degeneracies generated by estimation of covariance in estimation with high-dimension data.
- [[file:reference/BauschkeCombettes2011.org::Motivation][BauschkeCombettes2011]] ::
- [[file:reference/BesselmannEtAl2008.org::Motivation][BesselmannEtAl2008]] ::
- [[file:reference/BiegelEtAl2012.org::Motivation][BiegelEtAl2012]] ::
  Use of Shadow Prices to resolve grid congestion
- [[file:reference/Bin2022.org::Motivation][Bin2022]] ::
  Generalized recursive least squares
- [[file:reference/Bindra2017.org::Motivation][Bindra2017]] ::
  Examples of attacks in power systems
- [[file:reference/Bishop2006.org::Motivation][Bishop2006]] ::
- [[file:reference/BittantiEtAl1990.org::Motivation][BittantiEtAl1990]] ::
  Convergence of adaptive recursive least-squares algorithms
- [[file:reference/BlanchardEtAl2008.org::Motivation][BlanchardEtAl2008]] ::
  Use EKF to update polynomial chaos
- [[file:reference/BoemEtAl2020.org::Motivation][BoemEtAl2020]] ::
  Zonotope tube created to estimate possible outcomes of the state, if it is outside the tube then that is a fault.
- [[file:reference/BorrelliEtAl2017.org::Motivation][BorrelliEtAl2017]] ::
- [[file:reference/Bouckaert2014.org::Motivation][Bouckaert2014]] ::
  Smart Grids and Energetic Transition. Exampls of Reunion Island
- [[file:reference/BourdaisEtAl2012.org::Motivation][BourdaisEtAl2012]] ::
  Distributed MPC (Dual Decomposition) for continuous systems controlled using discrete inputs
- [[file:reference/BoydEtAl2011.org::Motivation][BoydEtAl2011]] ::
  Distributed optimization using [[id:6f210e88-50da-4dc2-9f28-c723667a7bc9][ADMM]]
- [[file:reference/BoydEtAl2015.org::Motivation][BoydEtAl2015]] ::
  Notes on dual and primal decomposition methods.

  Good Source for decomposing problems with complicatings constraints
- [[file:reference/BoydVandenberghe2004.org::Motivation][BoydVandenberghe2004]] ::
  Convex Optimization Bible
- [[file:reference/BoyleDykstra1986.org::Motivation][BoyleDykstra1986]] ::
  Project into intersection of convex set using projection to simpler regions
- [[file:reference/BradleyMangasarian2000.org::Motivation][BradleyMangasarian2000]] ::
  Presentation of K-plane algorithm
- [[file:reference/BramsTaylor1995.org::Motivation][BramsTaylor1995]] ::
  Protocols to solve n-agents unsupervised envy-free cake cutting problem
- [[file:reference/BraunEtAl2020.org::Motivation][BraunEtAl2020]] ::
  Identify attack using evolution of coupling variables
- [[file:reference/CamachoBordons2007.org::Motivation][CamachoBordons2007]] ::
  Book on [[id:adbf20b1-1a2d-4c90-9a66-2f236db55322][MPC]]
- [[file:reference/CamisaEtAl2022.org::Motivation][CamisaEtAl2022]] ::
  Primal decomposition for Mixed-integer Linear Programming
- [[file:reference/CeleuxGovaert1992.org::Motivation][CeleuxGovaert1992]] ::
  :PROPERTIES:
  :ID:       55fe199e-3f4b-4c40-85ae-01753e9bce9f
  :END:
  Propose Stochastic version of [[id:1d06659d-d255-4ce2-a590-2652c630a32d][Expectation Maximization]] algorithm and also Classification EM algorithm
- [[file:reference/ChanfreutEtAl2018.org::Motivation][ChanfreutEtAl2018]] ::
  Show vulnerabilites in a dMPC structure using Jacobi-Gauss decomposition
- [[file:reference/ChristofidesEtAl2013.org::Motivation][ChristofidesEtAl2013]] ::
  Review of dMPC frameworks
- [[file:reference/DaiEtAl2022.org::Motivation][DaiEtAl2022]] ::
  A resource allocation based distributed optimization based on consensus, distributed topology and strongly connected graph
- [[file:reference/DibajiIshii2015.org::Motivation][DibajiIshii2015]] ::
  Consensus of second order sampled-data in presence of misbehaving agents. This article uses a modified Mean subsequence Reduced (MSR) algorithm, where $f$ greatest and $f$ smallest values are ignored.
- [[file:reference/DigraPandey2013.org::Motivation][DigraPandey2013]] ::
  Multi-agent based controller coordination of microgrid with critical loads under  normal, faulty and overload conditions.
- [[file:reference/DingEtAl2018.org::Motivation][DingEtAl2018]] ::
  Survey on Security control and attack detection
- [[file:reference/ElGhaoui2002.org::Motivation][ElGhaoui2002]] ::
  A new quantity to characterize inversion error
- [[file:reference/FariaSoromenho2010.org::Motivation][FariaSoromenho2010]] ::
- [[file:reference/Ferrari-TrecateEtAl2001.org::Motivation][Ferrari-TrecateEtAl2001]] ::
  [[id:265d4605-0b90-4f6a-b495-304f2eb038f4][Identification]] of PWA systems using modified [[id:44b6d4d0-9ac3-4f0e-bae8-6b857431ff04][K-means]], use covariance in the norm
- [[file:reference/Frangipani2015.org::Motivation][Frangipani2015]] ::
  This article uses Unscented Kalman Filter (UKF) to localize a submarine using one acoustic reference.
- [[file:reference/FranzeEtAl2022.org::Motivation][FranzeEtAl2022]] ::
  Mitigation of False Data injection ([[id:a60ecbf6-c6d2-404e-8001-71ed8c41692f][replay attack]]) in MPC Constrained, 2 MPC types, delay-MPC and N-MPC
- [[file:reference/FungMangasarian2001.org::Motivation][FungMangasarian2001]] ::
  Use two parallel planes instead of one (as in standard SVM) in order to handle larger sets.
- [[file:reference/GepperthPfuelb2021.org::Motivation][GepperthPfuelb2021]] ::
  Use Stochastic Gradient Descent to efficiently train Gaussian Mixture Model for high-dimensional streaming data.
- [[file:reference/GilbertEtAl1988.org::Motivation][GilbertEtAl1988]] ::
  This article proposes a fast procedure to compute distance between complex objects. Great use of Minkowski sum.
- [[file:reference/GossnerEtAl1997.org::Motivation][GossnerEtAl1997]] ::
  Algorithms for stability and asymptotic tracking in constrained generalized predictive control with bounded disturbances
- [[file:reference/GoudaEtAl2002.org::Motivation][GoudaEtAl2002]] ::
  Here we find a lower order example of thermal modelling of rooms
- [[file:reference/GrimsmanEtAl2019.org::Motivation][GrimsmanEtAl2019]] ::
  Impact of topology, decision order, and information distribution to agent decisions and consequently on the consensus.
- [[file:reference/GuEtAl2016.org::Motivation][GuEtAl2016]] ::
  Example microgrid system with a multi-agent system with fault protection using current values.
- [[file:reference/HeEtAl2022.org::Motivation][HeEtAl2022]] ::
  :PROPERTIES:
  :ID:       21795c2d-b756-4886-a27a-d00eded4ed3a
  :END:
  Secure STMPC by protecting data and switching to mode where protected control is interpolated
- [[file:reference/HosseiniSra2015.org::Motivation][HosseiniSra2015]] ::
  :PROPERTIES:
  :ID:       49823af8-780e-4a5d-bb20-93f1cada37cb
  :END:
  Use Riemannian manifold optimization as replacement for [[id:1d06659d-d255-4ce2-a590-2652c630a32d][Expectation Maximization]] to estimate [[id:0f476a7a-61a0-4adb-9c7b-5d309c426a51][Gaussian Mixture Model]]s
- [[file:reference/HuangDong2020.org::Motivation][HuangDong2020]] ::
  Reliable control in systems with intermittent communication
- [[file:reference/Iiduka2019.org::Motivation][Iiduka2019]] ::
  Distributed optimal resource allocation. Comparison between different distributed optimization algorithms, Projected Proximal Algorithm, Projected Subgradient Algorithm and other for nonsmooth convex optimization.
- [[file:reference/Jury1962.org::Motivation][Jury1962]] ::
  Stability criterion for linear discrete time systems
- [[file:reference/Kalouptsidis1997.org::Motivation][Kalouptsidis1997]] ::
- [[file:reference/KarlisXekalaki2003.org::Motivation][KarlisXekalaki2003]] ::
  Comparison of choices of initialization for the [[id:1d06659d-d255-4ce2-a590-2652c630a32d][Expectation Maximization]] algorithm
- [[file:reference/KatewaEtAl2021.org::Motivation][KatewaEtAl2021]] ::
  Quantify trade-off between security and privacy
- [[file:reference/KolarijaniEtAl2020.org::Motivation][KolarijaniEtAl2020]] ::
  [[id:0048fff1-e997-4b77-8215-ea92fe7dd527][Decentralized]] [[id:02289306-4cb1-4371-a5da-eedd95e7b268][Event-Based]] [[id:b17ed041-9184-40bd-adaa-0c8f144b63f2][Robust]] [[id:adbf20b1-1a2d-4c90-9a66-2f236db55322][MPC]]
- [[file:reference/KuzinEtAl2020.org::Motivation][KuzinEtAl2020]] ::
  Use of multiple Raspberry Pi as HIL to simulate agents
- [[file:reference/LandauEtAl2011.org::Motivation][LandauEtAl2011]] ::
  Adaptive Control
  Reference on [[id:0147d11c-6d28-4f4c-98ac-23eb096ff3fa][recursive least-squares]] parameter estimation.
- [[file:reference/LauerBloch2019.org::Motivation][LauerBloch2019]] ::
  Identification of Hybrid Systems
- [[file:reference/LeBlancEtAl2013.org::Motivation][LeBlancEtAl2013]] ::
  Resilient consensus in the presence of misbehaving nodes. Resilience is achieved by ignoring the extreme values
- [[file:reference/LiceagaCastroEtAl2015.org::Motivation][LiceagaCastroEtAl2015]] ::
  Show that [[id:f62d60ca-4a29-4d6e-8ead-89e4dda9aca3][MIMO]] systems controlled passively are not necessarily robust.
- [[file:reference/LinEtAl2020.org::Motivation][LinEtAl2020]] ::
  Obtain state estimation under delayed communication
- [[file:reference/LiuEtAl2009.org::Motivation][LiuEtAl2009]] ::
  False data injection attack that isn't detected using norm of linear regression model residues.
- [[file:reference/LiuEtAl2016.org::Motivation][LiuEtAl2016]] ::
  Study of Networked Control in a [[id:3ec3cd81-0163-4fe1-9c20-b5dfd33427d6][Stochastic]] [[id:a3b6d44b-4f1d-43dd-942b-45c2df959e6e][Hybrid Control]] Scheme using stochastic variable with [[id:66cea64f-9e73-423a-80f2-58fd01dd5b6c][Bernoulli Distribution]] in order to increase performance on over occupied channels
- [[file:reference/LiuEtAl2019.org::Motivation][LiuEtAl2019]] ::
  Analysis of the effects of[[id:1378c4c8-b824-4748-917d-904632acfd75][Deception Attacks]] and use [[id:a3b6d44b-4f1d-43dd-942b-45c2df959e6e][Hybrid Control]] and verify stability using Lyapunov
- [[file:reference/LiuEtAl2022.org::Motivation][LiuEtAl2022]] ::
   [[id:6f210e88-50da-4dc2-9f28-c723667a7bc9][ADMM]] [[id:92ed23b5-1480-4241-b074-a5b4a1d42069][DMPC]] based on reduced scenario trees with nonlinear models
- [[file:reference/LuciaEtAl2021.org::Motivation][LuciaEtAl2021]] ::
  Use 2 [[id:5133942a-3973-406d-ae61-67709c4f9c98][Command Governor]]s  in order to detect setpoint attack. If attacker has complete information about system, attack is still possible. In order to counteract [[id:1158d11b-d0e9-40dd-bdd8-bbeb85092f71][watermarking]] is used
- [[file:reference/LuEtAl2022.org::Motivation][LuEtAl2022]] ::
- [[file:reference/LuYang2020.org::Motivation][LuYang2020]] ::
  State [[id:73c6fea6-0266-4dfb-b66b-0c502c51cbab][Estimation]] of NCS, with faulty and malicious agents based on [[id:fbd817a8-43a5-4b8e-95b5-7b199bf98be1][Least-squares]]
- [[file:reference/MaestreEtAl2021.org::Motivation][MaestreEtAl2021]] ::
  Similar to cite:VelardeEtAl2017a but showing how to compute the scenarios
  Interesting way to present cumulative cost
- [[file:reference/MarafiotiEtAl2014.org::Motivation][MarafiotiEtAl2014]] ::
  In this article an non-convex input constraint is added to the MPC formulation to provide
  guarantees on signal «richness». Some of this can be used to identify parameters during a negotiation for distributed MPC. A difference is that the controller is not memory-less and due to the persistent excitation, the solution is not necessarily optimal, when compared with the MPC without the added constraint.
- [[file:reference/McNamaraEtAl2018.org::Motivation][McNamaraEtAl2018]] ::
- [[file:reference/MendhamClarke2005.org::Motivation][MendhamClarke2005]] ::
  Simulation environment of multi-agent system embedded into industry standard
- [[file:reference/MorosanEtAl2011.org::Motivation][MorosanEtAl2011]] ::
  [[id:92ed23b5-1480-4241-b074-a5b4a1d42069][DMPC]] based on Bender's decomposition
- [[file:reference/MoSinopoli2009.org::Motivation][MoSinopoli2009]] ::
- [[file:reference/MukherjeeZelazo2019.org::Motivation][MukherjeeZelazo2019]] ::
  Uses of Kharitonov's Theorem to study condition for consensus of $m$-th order linear uncertain interval plants
- [[file:reference/Norton1986.org::Motivation][Norton1986]] ::
  Book about system identification.

  Good notes on parameter estimation.
- [[file:reference/NotarnicolaNotarstefano2020.org::Motivation][NotarnicolaNotarstefano2020]] ::
  Distributed optimization algorithm taking into account network's topology
- [[file:reference/OConnorVandenberghe2014.org::Motivation][OConnorVandenberghe2014]] ::
  Use of decomposition methods to solve image deblurring
- [[file:reference/Ouyang2020.org::Motivation][Ouyang2020]] ::
  Projection onto intersections of halfspaces and hyperplanes
- [[file:reference/OzerovFevotte2010.org::Motivation][OzerovFevotte2010]] ::
  Show how to use simulated annealing to increase convergence
- [[file:reference/QuandtRamsey1978.org::Motivation][QuandtRamsey1978]] ::
- [[file:reference/RajeshEtAl2013.org::Motivation][RajeshEtAl2013]] ::
  Framework for MAS with simulation in rural Indian micro-grid
- [[file:reference/Reams1999.org::Motivation][Reams1999]] ::
  Hadamard operations.
- [[file:reference/RichardsHow2006.org::Motivation][RichardsHow2006]] ::
  [[id:b17ed041-9184-40bd-adaa-0c8f144b63f2][Robust]] [[id:adbf20b1-1a2d-4c90-9a66-2f236db55322][MPC]] with tightening constraints
- [[file:reference/RollEtAl2004.org::Motivation][RollEtAl2004]] ::
- [[file:reference/SatchidanandanKumar2017.org::Motivation][SatchidanandanKumar2017]] ::
  Use of [[id:1158d11b-d0e9-40dd-bdd8-bbeb85092f71][Watermarking]] as active defense. Study for different types of systems, ARX, ARMAX, SISO with partial observations, MIMO with gaussian noise, extension to non-gaussian
- [[file:reference/SchulzeEtAl2022.org::Motivation][SchulzeEtAl2022]] ::
- [[file:reference/ShiromotoEtAl2019.org::Motivation][ShiromotoEtAl2019]] ::
  Use of separable metric structures to distributed nonlinear control
- [[file:reference/SujilKumar2017.org::Motivation][SujilKumar2017]] ::
  Multi-agent based system simulated in the presence of different events
- [[file:reference/TabatabaeiPourEtAl2006.org::Motivation][TabatabaeiPourEtAl2006]] ::
  Estimate parameters of affine submodels and the partition of the map from data
- [[file:reference/TanikawaMukai1983a.org::Motivation][TanikawaMukai1983a]] ::
  Creation of new lagrangian to convexify the lagrangian function, reducing decomposition to two levels of iterative optimization
- [[file:reference/TanikawaMukai1983.org::Motivation][TanikawaMukai1983]] ::
  New separable (lagrange-like) multiplier to nonconvex separable large-scale problems.
- [[file:reference/VelardeEtAl2017a.org::Motivation][VelardeEtAl2017a]] ::
  Secure dMPC for consensus using scenario based mechanism
- [[file:reference/VelardeEtAl2017b.org::Motivation][VelardeEtAl2017b]] ::
  Vulnerabilities in lagrange-based dMPC scheme on multi-agent consensus
- [[file:reference/VelardeEtAl2017.org::Motivation][VelardeEtAl2017]] ::
  Analysis of dual decomposition [[FILE:20200709101933-dmpc.org][DMPC]] scheme under influence of malicious agents. It presents different types of attacks.
- [[file:reference/VidalEtAl2005.org::Motivation][VidalEtAl2005]] ::
  Segment subspaces of unknown and varying dimensions from sample data points
- [[file:reference/VoulgarisElia2022.org::Motivation][VoulgarisElia2022]] ::
- [[file:reference/WakaikiEtAl2020.org::Motivation][WakaikiEtAl2020]] ::
  [[File:20200504113017-stability.org][stability]] on NCS with [[id:6f1e8604-b30c-4428-b9e3-7b06a60646b2][DoS]] and quantization noise using observer-based controller
- [[file:reference/WangIshii2019.org::Motivation][WangIshii2019]] ::
- [[file:reference/WangYang2022.org::Motivation][WangYang2022]] ::
  Use integrator to accelerate convergence on cooperative dMPC
- [[file:reference/WuEtAl2018.org::Motivation][WuEtAl2018]] ::
  [[id:a6fbcdd3-a1a1-4dd5-bf26-dd778fdfab56][Neural Networks]] based detection and Lyapunov [[id:adbf20b1-1a2d-4c90-9a66-2f236db55322][MPC]], using cumulative sum detection
- [[file:reference/WuZhao2006.org::Motivation][WuZhao2006]] ::
  Use SVM to classify unlabeled data
- [[file:reference/Yamasaki2016.org::Motivation][Yamasaki2016]] ::
  Adaptive robust altitude control scheme based on a smooth sliding mode controller
- [[file:reference/YangEtAl2019.org::Motivation][YangEtAl2019]] ::
  [[id:3ec3cd81-0163-4fe1-9c20-b5dfd33427d6][Stochastic]] [[id:92ed23b5-1480-4241-b074-a5b4a1d42069][dMPC]] with defense against [[id:6f1e8604-b30c-4428-b9e3-7b06a60646b2][DoS]] Attacks
- [[file:reference/YangEtAl2022.org::Motivation][YangEtAl2022]] ::
  Good references on power systems vulnerabilities.
- [[file:reference/YimEtAl2012.org::Motivation][YimEtAl2012]] ::
  Estimation of non-linear systems using EKF and UKF
- [[file:reference/Zafiriou1990.org::Motivation][Zafiriou1990]] ::
- [[file:reference/ZhuMartinez2014.org::Motivation][ZhuMartinez2014]] ::
  Resilient MPC with resource allocation to deal with replay attacks
- [[file:reference/ZhuZheng2020.org::Motivation][ZhuZheng2020]] ::
  Observer based $\mathcal{H}_\infty$ control in [[id:6f1e8604-b30c-4428-b9e3-7b06a60646b2][DoS]] prone measurement and control channels
#+end_results
